src/DataProcessors/ВыгрузкаНаСайт/ВыгрузкаНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаНаСайт</name>
</mdclass:DataProcessor>

src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Аттракционы/Аттракционы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Аттракционы</name>
  <attributes>
    <name>ВидАттракциона</name>
    <type>
      <types>CatalogRef.ВидыАттракционов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.АттракционыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоПеренесено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ВыгрузкаНаСайт/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Готовит архив, содержащий список аттракционов и файлы фотографий
// 
// Возвращаемое значение:
//  Строка -  Адрес временного хранилища с архивом
Функция ПодготовитьАрхив() Экспорт
	
	Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("ВыгрузкаНаСайт");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Аттракционы.Ссылка)) КАК Идентификатор,
		|	ПРЕДСТАВЛЕНИЕ(Аттракционы.Ссылка) КАК Аттракцион,
		|	ПРЕДСТАВЛЕНИЕ(Аттракционы.ВидАттракциона) КАК ВидАттракциона,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
		|	Аттракционы.Фото КАК Фото
		|ИЗ
		|	Справочник.Аттракционы КАК Аттракционы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|		ПО Аттракционы.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(Замер, Выборка.Количество(), "ВыполнениеЗапроса");
	
	ИмяКаталога = ПолучитьИмяВременногоФайла("");
	СоздатьКаталог(ИмяКаталога);
	
	ОписаниеАттракционов = Новый Массив;
	
	ШаблонИмениКартинки = "%1%2%3";
	
	ДлительныеОперации.СообщитьПрогресс(33, НСтр("ru = 'Запущена выгрузка аттракционов...'"));
	
	//ОбновлениеИнформационнойБазыСлужебный.Пауза(4);
	
	Пока Выборка.Следующий() Цикл
		
		ОписаниеАттракциона = Новый Структура;
		ОписаниеАттракциона.Вставить("Идентификатор", Выборка.Идентификатор);
		ОписаниеАттракциона.Вставить("Аттракцион", Выборка.Аттракцион);
		ОписаниеАттракциона.Вставить("ВидАттракциона", Выборка.ВидАттракциона);
		ОписаниеАттракциона.Вставить("Цена", Выборка.Цена);
		ОписаниеАттракциона.Вставить("Фото", Неопределено);
		
		Если ЗначениеЗаполнено(Выборка.Фото) Тогда
			ДанныеФайла = РаботаСФайлами.ДанныеФайла(Выборка.Фото);
			ИмяФайла = Строка(Выборка.Фото.УникальныйИдентификатор()) + ДанныеФайла.ИмяФайла;
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
			ПолноеИмяФайла = СтрШаблон(ШаблонИмениКартинки, ИмяКаталога, ПолучитьРазделительПути(), ИмяФайла);
			ДвоичныеДанные.Записать(ПолноеИмяФайла);			
			ОписаниеАттракциона.Фото = ПолучитьРазделительПути() + ИмяФайла;
		КонецЕсли;
		
		ОписаниеАттракционов.Добавить(ОписаниеАттракциона);
		
	КонецЦикла;
	
	ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(Замер, Выборка.Количество(), "СформированКаталог");
	
	ШаблонИмениФайлаВыгрузки = "%1%2export.json";
	ИмяФайлаВыгрузки = СтрШаблон(ШаблонИмениФайлаВыгрузки, ИмяКаталога, ПолучитьРазделительПути());
	
	Запись = Новый ЗаписьJSON;
	Запись.ОткрытьФайл(ИмяФайлаВыгрузки);
	ЗаписатьJSON(Запись, ОписаниеАттракционов);
	Запись.Закрыть();
	
	ДлительныеОперации.СообщитьПрогресс(66, НСтр("ru = 'Формируем архив...'"));
	
	Архиватор = Новый ЗаписьZipФайла;
	//@skip-check bsl-legacy-check-static-feature-access
	Архиватор.Добавить(ИмяКаталога + ПолучитьРазделительПути() + "*.*",, 
		РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ДанныеАрхива = Архиватор.ПолучитьДвоичныеДанные();
		
	ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(Замер, Выборка.Количество(), "СформированАрхив");
	
	//ОбновлениеИнформационнойБазыСлужебный.Пауза(4);
	
	УдалитьФайлы(ИмяКаталога);
		
	ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(Замер, Выборка.Количество(), "УдаленыВременныеФайлы");
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Замер, Выборка.Количество());
	
	Возврат ДанныеАрхива;
	
КонецФункции

#КонецОбласти

#КонецЕсли
